Transmitter/src/Catalogs/ОбработчикиВнешнихЗапросов/ОбработчикиВнешнихЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбработчикиВнешнихЗапросов</name>
  <attributes>
    <name>АдресПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияСобытий</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСостояния</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПриложения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Transmitter/src/Catalogs/ОбработчикиВнешнихЗапросов/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ЗагрузитьИсториюСобытий загружает отобранные данные из журнала регистрации в табличную часть обработчика.
// 
// Параметры:
// 	ДатаНачала - Дата - дата начала отбора данных;
// 	ДатаОкончания - Дата - дата окончания отбора данных;
//
Процедура ЗагрузитьИсториюСобытий( Знач ДатаНачала, Знач ДатаОкончания ) Экспорт
	
	Отбор = Новый Структура( "ДатаНачала, ДатаОкончания", ДатаНачала, ДатаОкончания );
	
	ЖурналРегистрации = Логи.ПолучитьИсториюСобытий( Логи.ПредставленияСобытий(), Отбор );
	
	ИсторияСобытий.Очистить();
	
	Для Каждого ЗаписьЖурналаРегистрации Из ЖурналРегистрации Цикл
		
		Если ( ЗаписьЖурналаРегистрации.Данные = Неопределено ИЛИ ЗаписьЖурналаРегистрации.Данные = Ссылка ) Тогда
			
			ЗаполнитьЗначенияСвойств( ИсторияСобытий.Добавить(), ЗаписьЖурналаРегистрации );
			
		КонецЕсли;
		
	КонецЦикла;
	
	Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью( Отказ )
	
	Если ( Отказ Или ОбменДанными.Загрузка ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Обработчики = Справочники.ОбработчикиВнешнихЗапросов.НайтиПоАдресуПроекта( АдресПроекта );
	
	Для Каждого Обработчик Из Обработчики Цикл
		
		Если ( Ссылка = Обработчик.Обработчик ) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Сообщение = НСтр("ru = 'Такой проект уже существует';en = 'This project already exists'");
		
		//@skip-check invocation-parameter-type-intersect
		ОбщегоНазначения.СообщитьПользователю( Сообщение, ЭтотОбъект, "АдресПроекта", , Отказ );
		
		Возврат;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
